#pandas tutorial

In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name" : ["harsh","het","mans","dhaval"],
    "marks": [99 ,34, 45, 45],
    "city" : ["jamnagar","rajkot","patidar","manaroad"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks      city
0   harsh     99  jamnagar
1     het     34    rajkot
2    mans     45   patidar
3  dhaval     45  manaroad

In [5]:
df.to_csv("data.csv")

In [6]:
df.to_csv("data_indexnot_found.csv" , index = False)

In [7]:
df.head(2)

    name  marks      city
0  harsh     99  jamnagar
1    het     34    rajkot

In [8]:
df.tail(2)

     name  marks      city
2    mans     45   patidar
3  dhaval     45  manaroad

In [9]:
df.describe()

           marks
count   4.000000
mean   55.750000
std    29.295904
min    34.000000
25%    42.250000
50%    45.000000
75%    58.500000
max    99.000000